---
kind: property
id: P:Autodesk.Revit.DB.InSessionViewSheetSet.IsAutomatic
source: html/4b9fd1d2-464b-d7e0-0efc-edfc831c60d4.htm
---
# Autodesk.Revit.DB.InSessionViewSheetSet.IsAutomatic Property

Automatic order or manual order.

## Syntax (C#)
```csharp
public virtual bool IsAutomatic { get; set; }
```